# SymbolicCurveArray Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolicCurveArray Class
Members See Also
---
An array that contains model curves.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class SymbolicCurveArray : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class SymbolicCurveArray _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class SymbolicCurveArray : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..SymbolicCurveArray
# See Also
SymbolicCurveArray Members
Autodesk.Revit.DB Namespace